[
  {
    "name": "Nightline",
    "url": "https://norwich.nightline.ac.uk/",
    "desc": "A student-run, overnight listening service providing confidential, non-advisory emotional support to UEA students facing personal challenges."
  },
  {
    "name": "Advice SU",
    "url": "https://www.ueasu.org/advice/",
    "desc": "Professional and student-led advice service offering confidential guidance on academic, financial, housing, and welfare issues to UEA students."
  },
  {
    "name": "Student Counselling",
    "url": "https://www.uea.ac.uk/uea-life/student-support/wellbeing",
    "desc": "University-run counselling centre providing free one-to-one therapy, group workshops, and wellbeing resources to support student mental health."
  },
  {
    "name": "Samaritans",
    "url": "https://www.samaritans.org/how-we-can-help/contact-samaritan/",
    "desc": "A 24/7 free helpline offering compassionate, non-judgmental emotional support and crisis intervention for anyone experiencing distress."
  },
  {
    "name": "Accommodation",
    "url": "https://www.uea.ac.uk/uea-life/accommodation",
    "desc": "Comprehensive guidance on on-campus and off-campus housing options, application processes, contracts, and tenancy support for students."
  },
  {
    "name": "Report and Support",
    "url": "https://reportandsupport.uea.ac.uk/",
    "desc": "Secure online platform for reporting harassment, bullying, discrimination, or safety concerns with confidential assistance from trained staff."
  },
  {
    "name": "Security",
    "url": "https://www.uea.ac.uk/about/information-for-visitors/contact-information-and-map",
    "desc": "UEA Campus Security Team providing 24/7 patrols, emergency response, and safety advice to ensure a secure campus environment."
  },
  {
    "name": "Housing Advice",
    "url": "https://www.ueasu.org/advice/housing-issues/",
    "desc": "Specialist advice on tenancy rights, deposits, dispute resolution, and legal support for students living off campus."
  },
  {
    "name": "Disability Advice",
    "url": "https://www.uea.ac.uk/uea-life/student-support/disability-support",
    "desc": "Dedicated team offering academic adjustments, assistive technology, and advocacy for students with disabilities or long-term health conditions."
  },
  {
    "name": "Counselling and mental health",
    "url": "https://www.ueasu.org/advice/health-and-personal/",
    "desc": "UEA SU service providing confidential counselling, mental health workshops, and signposting to professional wellbeing resources."
  },
  {
    "name": "Clubs",
    "url": "https://www.ueasu.org/opportunities/clubs/",
    "desc": "Directory of sports, hobby, and special interest clubs offering opportunities for social connection and skill development."
  },
  {
    "name": "Societies",
    "url": "https://www.ueasu.org/opportunities/societies/",
    "desc": "Extensive list of academic, cultural, and recreational societies fostering community engagement and personal growth."
  },
  {
    "name": "Learning Enhancement Team",
    "url": "https://www.uea.ac.uk/uea-life/student-support/learning-enhancement",
    "desc": "Campus service providing academic skills workshops, study planning, and one-to-one support to improve learning strategies."
  },
  {
    "name": "Peer Assisted Learning Mentors",
    "url": "https://www.uea.ac.uk/study/information-for/supporting-your-studies",
    "desc": "Experienced student mentors facilitating group study sessions and one-to-one tutoring to reinforce course concepts."
  },
  {
    "name": "Student Support Services",
    "url": "https://www.uea.ac.uk/uea-life/student-support/student-information-zone",
    "desc": "Central hub offering information and guidance on wellbeing, finance, accommodation, and general student enquiries."
  },
  {
    "name": "UEA Student Support Services",
    "url": "https://www.uea.ac.uk/uea-life/student-support/student-information-zone",
    "desc": "Central support centre providing comprehensive advice on academic, personal, and welfare matters for UEA students."
  },
  {
    "name": "Faith and Spirituality",
    "url": "https://www.ueasu.org/communities/faithandspirituality/",
    "desc": "Interfaith chaplaincy and community network offering spiritual guidance, religious events, and a safe space for all beliefs."
  },
  {
    "name": "The Cruse Bereavement Charity",
    "url": "https://www.cruse.org.uk/",
    "desc": "UK-wide charity providing bereavement counselling, support groups, and resources for individuals coping with loss."
  },
  {
    "name": "The Good Grief Trust",
    "url": "https://www.thegoodgrieftrust.org/",
    "desc": "National network offering tailored bereavement support, information, and access to local grief services."
  },
  {
    "name": "UEA Career Central",
    "url": "https://mycareercentral.uea.ac.uk/",
    "desc": "Online portal providing CV feedback, career workshops, employer events, and internship opportunities."
  },
  {
    "name": "UEA hardship fund",
    "url": "https://www.ueasu.org/advice/cost-of-living/",
    "desc": "Emergency financial grants to assist students facing acute hardship with essentials like food, rent, and study materials."
  },
  {
    "name": "Access to Learning fund",
    "url": "https://www.uea.ac.uk/study/fees-and-funding",
    "desc": "University-administered bursary supporting students with exceptional financial need to continue their studies."
  },
  {
    "name": "UEA financial Advice",
    "url": "https://www.uea.ac.uk/about/university-information/finance-and-procurement/finance-information-for-students",
    "desc": "Finance team offering budgeting advice, debt guidance, loan information, and financial wellbeing workshops."
  },
  {
    "name": "UEA bursaries and scholarships",
    "url": "https://www.uea.ac.uk/study/fees-and-funding",
    "desc": "Comprehensive overview of merit-based and need-based awards, scholarships, and bursary opportunities."
  },
  {
    "name": "Sportspark",
    "url": "https://www.sportspark.co.uk/",
    "desc": "State-of-the-art sports centre with gyms, swimming pools, courts, fitness classes, and wellness programmes."
  },
  {
    "name": "Library",
    "url": "https://www.uea.ac.uk/library",
    "desc": "UEA Library offering extensive collections, study spaces, online resources, and research support services."
  },
  {
    "name": "Career Central",
    "url": "https://mycareercentral.uea.ac.uk/",
    "desc": "Career development hub providing job listings, employer networking events, and personalised career guidance."
  },
  {
    "name": "Study skills",
    "url": "https://www.uea.ac.uk/uea-life/student-support/learning-enhancement",
    "desc": "Workshops and resources focused on effective study techniques, time management, and academic writing."
  },
  {
    "name": "NHS Choices",
    "url": "https://www.nhs.uk/",
    "desc": "Official NHS website offering reliable health information, symptom checkers, and guidance on treatments."
  },
  {
    "name": "Medical centre",
    "url": "https://www.umsuea.co.uk/",
    "desc": "On-campus NHS-affiliated medical centre providing GP services, vaccinations, and health consultations to students."
  },
  {
    "name": "NHS Direct 111",
    "url": "https://111.nhs.uk/",
    "desc": "Free NHS non-emergency phone line and online service offering urgent medical advice and support."
  },
  {
    "name": "FRANK",
    "url": "https://www.talktofrank.com/",
    "desc": "Confidential drug information service providing facts, advice, and a helpline on substance use and harm reduction."
  },
  {
    "name": "N&N hospital",
    "url": "https://www.nnuh.nhs.uk/",
    "desc": "Norfolk & Norwich University Hospital offering acute, specialist, and emergency medical care."
  },
  {
    "name": "Accommodation office",
    "url": "https://www.uea.ac.uk/uea-life/accommodation/contact-us",
    "desc": "UEA Accommodation Office handling room allocations, maintenance requests, and housing policy information."
  },
  {
    "name": "UEA Dental Practice",
    "url": "https://www.nhs.uk/services/dentist/uea-dental-practice/V000835",
    "desc": "On-campus dental surgery offering NHS dental care, check-ups, and oral health advice to students."
  }
]